<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 6 changes.</summary>

```diff
! module.coreos-module-vm.proxmox_virtual_environment_download_file.coreos_img must be replaced
! module.coreos-module-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
! module.coreos-module-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
! module.coreos-module-vm2.proxmox_virtual_environment_download_file.coreos_img must be replaced
! module.coreos-module-vm2.proxmox_virtual_environment_file.cloud_user_config must be replaced
! module.coreos-module-vm2.proxmox_virtual_environment_vm.coreos_vm must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 6 to add, 0 to change, 6 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-11T21:21:35Z [(view log)](https://github.com/perchnet/p/actions/runs/16229987977/job/45830647059#step:9:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.coreos-module-vm.proxmox_virtual_environment_download_file.coreos_img must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "coreos_img" {
      ~ file_name               = "coreos_testing_proxmoxve_xd9o08.qcow2.xz.img" -> "coreos_testing_proxmoxve_7fb66f45.qcow2.xz.img" # forces replacement
      ~ id                      = "zssd-files:iso/coreos_testing_proxmoxve_xd9o08.qcow2.xz.img" -> (known after apply)
      ~ size                    = 1981022208 -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.coreos-module-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "stunning-bear.xd9o08.butane-ci-user-data.ign" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/stunning-bear.xd9o08.butane-ci-user-data.ign" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ file_name = "stunning-bear.xd9o08.butane-ci-user-data.ign" -> "stunning-bear.4459cdf0.butane-ci-user-data.ign" # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # module.coreos-module-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "131" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:DC:B2:7C",
        ] -> (known after apply)
        name                    = "stunning-bear"
      ~ network_interface_names = [] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 131 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ file_id           = "zssd-files:iso/coreos_testing_proxmoxve_xd9o08.qcow2.xz.img" -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-131-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          ~ user_data_file_id    = "snippets:snippets/stunning-bear.xd9o08.butane-ci-user-data.ign" -> (known after apply) # forces replacement
          + vendor_data_file_id  = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:DC:B2:7C" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.coreos-module-vm2.proxmox_virtual_environment_download_file.coreos_img must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "coreos_img" {
      ~ file_name               = "coreos_testing_proxmoxve_mth6bp.qcow2.xz.img" -> "coreos_testing_proxmoxve_7fb66f45.qcow2.xz.img" # forces replacement
      ~ id                      = "zssd-files:iso/coreos_testing_proxmoxve_mth6bp.qcow2.xz.img" -> (known after apply)
      ~ size                    = 1981022208 -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.coreos-module-vm2.proxmox_virtual_environment_file.cloud_user_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "up-unicorn.mth6bp.butane-ci-user-data.ign" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/up-unicorn.mth6bp.butane-ci-user-data.ign" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = jsonencode(
              ~ {
                  ~ systemd         = {
                      ~ units = [
                            # (1 unchanged element hidden)
                            {
                                contents = <<-EOT
                                    [Unit]
                                    Description=uCore autorebase to signed OCI and reboot
                                    ConditionPathExists=/etc/ucore-autorebase/unverified
                                    ConditionPathExists=!/etc/ucore-autorebase/signed
                                    After=network-online.target
                                    Wants=network-online.target
                                    [Service]
                                    Type=oneshot
                                    StandardOutput=journal+console
                                    ExecStart=/usr/bin/rpm-ostree rebase --bypass-driver ostree-image-signed:docker://ghcr.io/ublue-os/ucore-hci:stable
                                    ExecStart=/usr/bin/touch /etc/ucore-autorebase/signed
                                    ExecStart=/usr/bin/systemctl disable ucore-signed-autorebase.service
                                    ExecStart=/usr/bin/systemctl reboot
                                    [Install]
                                    WantedBy=multi-user.target
                                EOT
                                enabled  = true
                                name     = "ucore-signed-autorebase.service"
                            },
                          + {
                              + contents = <<-EOT
                                    [Unit]
                                    Description=Download and set up Komodo Periphery
                                    After=network-online.target
                                    Wants=network-online.target
                                    [Service]
                                    Type=oneshot
                                    #StandardOutput=journal+console
                                    ExecStart=/usr/bin/curl -sSL https://raw.githubusercontent.com/moghtech/komodo/main/scripts/setup-periphery.py | python3
                                    [Install]
                                    WantedBy=multi-user.target
                                EOT
                              + enabled  = true
                              + name     = "setup-periphery.service"
                            },
                        ]
                    }
                    # (4 unchanged attributes hidden)
                } # forces replacement
            )
          ~ file_name = "up-unicorn.mth6bp.butane-ci-user-data.ign" -> "up-unicorn.a055a3a0.butane-ci-user-data.ign" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.coreos-module-vm2.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "132" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:CC:63:CC",
        ] -> (known after apply)
        name                    = "up-unicorn"
      ~ network_interface_names = [] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 132 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ file_id           = "zssd-files:iso/coreos_testing_proxmoxve_mth6bp.qcow2.xz.img" -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-132-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          ~ user_data_file_id    = "snippets:snippets/up-unicorn.mth6bp.butane-ci-user-data.ign" -> (known after apply) # forces replacement
          + vendor_data_file_id  = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:CC:63:CC" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 6 to add, 0 to change, 6 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-26-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->